Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/changelog.po
Languages: uk

source: Changelog
uk: Зміна

source: All notable changes to this project will be documented in this file.
uk: Усі помітні зміни в цьому проекті будуть задокументовані у цьому файлі.

source: Version 1.0.0 (2025-01-XX)
uk: Версія 1.0.0 (2025-01-XX)

source: Initial release.
uk: Початковий випуск.

source: Added
uk: Доданий

source: Basic device communication
uk: Основне спілкування пристрою

source: Serial port support
uk: Підтримка послідовних портів

source: Command sending and receiving
uk: Команда надсилання та отримання

source: Configuration management
uk: Управління конфігурацією

source: Comprehensive documentation
uk: Вичерпна документація

source: Example scripts
uk: Приклад сценарії

source: Fixed
uk: Нерухомий

source: Initial bug fixes
uk: Початкові виправлення помилок

source: Changed
uk: Змінювати

source: Initial implementation
uk: Початкова реалізація

source: Version 0.1.0 (Development)
uk: Версія 0.1.0 (розробка)

source: Initial development version
uk: Початкова версія розробки
