Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/contributing-software.po
Languages: uk

source: Software & Libraries
uk: Програмне забезпечення та бібліотеки

source: Contributing code, libraries, and tools to БАБАЙ project.
uk: Код, що надає внесок, бібліотеки та інструменти до проекту BBEBAй.

source: **All software must be thoroughly tested before submission!**
uk: ** Все програмне забезпечення повинно бути ретельно перевірити перед поданням! **

source: Overview
uk: Огляд

source: БАБАЙ software components:
uk: Бабай компоненти програмного забезпечення:

source: **Arduino Libraries** - Sensor/motor control libraries
uk: ** Бібліотеки Arduino ** - бібліотек управління датчиком/двигуном

source: **Educational Tools** - Programming aids for students
uk: ** Навчальні інструменти ** - Служби програмування для студентів

source: **Development Tools** - Tools for contributors
uk: ** Інструменти розробки ** - Інструменти для учасників

source: **Example Projects** - Reference implementations
uk: ** Приклад проектів ** - Довідкові реалізації

source: **Testing Utilities** - Validation and testing tools
uk: ** Утиліти для тестування ** - Інструменти для перевірки та тестування

source: All code must be:
uk: Весь код повинен бути:

source: ✅ **Well-documented** - Comments and guides ✅ **Tested** - Unit tests and examples ✅ **Educational** - Support learning ✅ **Compatible** - Work with both platforms ✅ **Open Source** - Proper licensing
uk: ✅ ** ДОКОМОГОТЕЛЬНІ ** - Коментарі та посібники ✅ ** Тестовані ** - одиничні тести та приклади ✅ ** Освітня ** - Підтримка навчання ✅ ** Сумісно ** - Робота з обома платформами ✅ ** Відкритий код ** - Правильне ліцензування

source: Coding Standards
uk: Стандарти кодування

source: Arduino Code
uk: Arduino код

source: Follow Arduino style guide:
uk: Дотримуйтесь посібника з стилю Arduino:

source: **Naming Conventions:**
uk: ** Конвенції про іменування: **

source: Variables: ``camelCase``
uk: Змінні: `` camelcase``````

source: Constants: ``UPPER_SNAKE_CASE``
uk: Константи: `` ups_snake_case``

source: Functions: ``camelCase``
uk: Функції: `` camelcase``

source: Classes: ``PascalCase``
uk: Класи: `` pascalcase``

source: Python Code
uk: Код Python

source: Follow PEP 8:
uk: Слідкуйте за PEP 8:

source: Other Languages
uk: Інші мови

source: Follow language-specific best practices
uk: Дотримуйтесь найкращих практик мови

source: Use linters and formatters
uk: Використовуйте вкладиші та форматери

source: Maintain consistency with existing code
uk: Підтримуйте узгодженість з існуючим кодом

source: Library Development
uk: Розвиток бібліотеки

source: Arduino Library Structure
uk: Структура бібліотеки Arduino

source: Required Files
uk: Необхідні файли

source: **library.properties:**
uk: ** Бібліотека.Properties: **

source: **keywords.txt:**
uk: ** Ключові слова.txt: **

source: Documentation Requirements
uk: Вимоги до документації

source: Every Library Must Include
uk: Кожна бібліотека повинна включати

source: What the library does
uk: Що робить бібліотека

source: Installation instructions
uk: Інструкції з установки

source: Basic usage example
uk: Основний приклад використання

source: API reference
uk: Посилання API

source: License information
uk: Інформація про ліцензію

source: **Examples**
uk: ** Приклади **

source: At least 2-3 working examples
uk: Щонайменше 2-3 робочих прикладів

source: Comments explaining each step
uk: Коментарі, що пояснюють кожен крок

source: Expected output
uk: Очікуваний вихід

source: Hardware setup instructions
uk: Інструкції з налаштування обладнання

source: **API Documentation**
uk: ** Документація API **

source: All public functions documented
uk: Всі публічні функції задокументовані

source: Parameter descriptions
uk: Описи параметрів

source: Return value descriptions
uk: Описи повернення вартості

source: Usage examples
uk: Приклади використання

source: Example Documentation:
uk: Приклад документації:

source: Testing Requirements
uk: Вимоги до тестування

source: All Code Must Be Tested
uk: Весь код повинен бути перевірений

source: **Unit Tests**
uk: ** Одиничні тести **

source: Test individual functions
uk: Перевірте окремі функції

source: Check edge cases
uk: Перевірка корпусів краю

source: Verify error handling
uk: Перевірте обробку помилок

source: **Integration Tests**
uk: ** Інтеграційні тести **

source: Test with actual hardware
uk: Тест із фактичним обладнанням

source: Test component interactions
uk: Взаємодія компонентів

source: Verify timing accuracy
uk: Перевірте точність часу

source: **Example Tests**
uk: ** Приклад тестів **

source: All examples compile
uk: Усі приклади складаються

source: Examples run correctly
uk: Приклади проходять правильно

source: Output matches documentation
uk: Виведення відповідає документації

source: Testing Tools
uk: Інструменти тестування

source: **ArduinoUnit** - Unit testing for Arduino
uk: ** Arduinounit ** - тестування одиниць на Arduino

source: **PlatformIO** - Build and test automation
uk: ** Platformio ** - Автоматизація побудови та тестування

source: **Hardware-in-the-loop** - Test with actual robots
uk: ** Апаратне забезпечення в петлі **-Тест із фактичними роботами

source: Submission Process
uk: Процес подання

source: **Proposal**
uk: ** Пропозиція **

source: Open GitHub Issue:
uk: Відкритий випуск Github:

source: **Development**
uk: ** Розробка **

source: After approval:
uk: Після затвердження:

source: Write clean, documented code
uk: Напишіть чистий, задокументований код

source: Create examples
uk: Створіть приклади

source: Test thoroughly
uk: Перевіряти ретельно

source: Write documentation
uk: Напишіть документацію

source: **Code Review**
uk: ** Огляд коду **

source: Submit Pull Request:
uk: Подайте запит на витяг:

source: Code follows standards
uk: Код слідує за стандартами

source: Tests pass
uk: Тести проходять

source: Documentation complete
uk: Документація завершена

source: Examples work
uk: Приклади працюють

source: **Testing**
uk: ** Тестування **

source: Maintainers will:
uk: Службові працівники будуть:

source: Review code quality
uk: Якість огляду коду

source: Test with hardware
uk: Тест із обладнанням

source: Verify educational value
uk: Перевірте навчальну цінність

source: Check compatibility
uk: Перевірте сумісність

source: **Merge**
uk: ** Злиття **

source: Once approved:
uk: Після затвердження:

source: Merge to main branch
uk: Об'єднання до головної гілки

source: Add to library index
uk: Додати до індексу бібліотеки

source: Announce to community
uk: Оголосити громаді

source: Quality Checklist
uk: Контрольний список якості

source: Before submitting:
uk: Перед поданням:

source: [ ] Code follows style guide
uk: [] Код слідує посібнику стилю

source: [ ] All functions documented
uk: [] Усі документовані функції

source: [ ] Examples included and tested
uk: [] Приклади, що включаються та перевіряються

source: [ ] README.md complete
uk: [] Readme.md завершено

source: [ ] library.properties correct
uk: [] бібліотека.properties правильні

source: [ ] keywords.txt included
uk: [] ключові слова.txt

source: [ ] Compatible with both platforms
uk: [] Сумісний з обома платформами

source: [ ] No warnings when compiling
uk: [] Ніяких попереджень при складанні

source: [ ] Tested with actual hardware
uk: [] Тестовано за допомогою фактичного обладнання

source: [ ] Educational value clear
uk: [] Освітня цінність чітка

source: [ ] License included
uk: [] Ліцензія включена

source: Common Pitfalls
uk: Загальні підводні камені

source: Avoid These
uk: Уникати цього

source: ❌ **No Documentation**
uk: ❌ ** немає документації **

source: Always document your code
uk: Завжди задокументуйте свій код

source: ❌ **Hardcoded Values**
uk: ❌ ** тверді кодовані значення **

source: Use constants and parameters
uk: Використовуйте константи та параметри

source: ❌ **No Error Handling**
uk: ❌ ** Немає помилок **

source: Check for invalid inputs
uk: Перевірте наявність недійсних входів

source: ❌ **Platform-Specific Code**
uk: ❌ ** Код конкретного платформи **

source: Ensure compatibility
uk: Забезпечити сумісність

source: ❌ **Blocking Operations**
uk: ❌ ** Блокуючі операції **

source: Use non-blocking approaches
uk: Використовуйте неблокуючі підходи

source: ❌ **Memory Leaks**
uk: ❌ ** Витоки пам'яті **

source: Properly manage resources
uk: Належним чином керувати ресурсами

source: ❌ **Uncommented Code**
uk: ❌ ** Некомментований код **

source: Explain complex logic
uk: Пояснити складну логіку

source: Example Projects
uk: Приклади проектів

source: Types of Contributions
uk: Види внесків

source: **Sensor Libraries:**
uk: ** Бібліотеки датчиків: **

source: Ultrasonic distance sensors
uk: Ультразвукові датчики відстані

source: Line following sensors
uk: Лінія наступних датчиків

source: IMU/gyroscope integration
uk: Інтеграція ІМУ/Гіроскоп

source: Environmental sensors
uk: Екологічні датчики

source: **Motor Control:**
uk: ** Контроль двигуна: **

source: DC motor drivers
uk: Драйвери двигуна постійного струму

source: Servo control
uk: Сервопір

source: Stepper motor control
uk: Крок управління двигуном

source: Speed regulation
uk: Регулювання швидкості

source: **Navigation:**
uk: ** Навігація: **

source: Obstacle avoidance
uk: Уникнення перешкод

source: Line following
uk: Рядок наступного

source: Path planning
uk: Планування шляхів

source: Localization
uk: Локалізація

source: **Educational Tools:**
uk: ** Навчальні інструменти: **

source: Debugging utilities
uk: Налагодження комунальних послуг

source: Calibration tools
uk: Інструменти калібрування

source: Serial monitors
uk: Серійні монітори

source: Configuration wizards
uk: Майстри конфігурації

source: Code Templates
uk: Шаблони коду

source: **Basic Arduino Library Template:**
uk: ** Основний шаблон бібліотеки Arduino: **

source: **Implementation Template:**
uk: ** Шаблон реалізації: **

source: Resources
uk: Ресурси

source: **Arduino Style Guide** - https://www.arduino.cc/en/Reference/StyleGuide
uk: ** Посібник із стилю Arduino ** - https://www.arduino.cc/en/reference/styleguide

source: **Git Workflow** - (see main contributing guide)
uk: ** GIT Workflow ** - (див. Основний посібник з внеску)

source: **Testing Guide** - (to be added)
uk: ** Посібник з тестування ** - (для додавання)

source: Questions?
uk: Питання?

source: Open GitHub Issue with tag ``software``
uk: Відкрийте проблему Github з тегом `` Програмне забезпечення'``

source: Contact ``@vergilium``
uk: Зверніться до ``@vergilium``

source: Join software development discussion
uk: Приєднуйтесь до обговорення розробки програмного забезпечення

source: :doc:`Back to Contributing Overview <contributing>`
uk: : doc: `Повернутися до огляду <plosing>` `
