Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/contributing-documentation.po
Languages: uk

source: Documentation Development
uk: Розробка документації

source: Contributing to БАБАЙ project documentation.
uk: Сприяє документації проекту в Бабах.

source: **Good documentation is essential for educational projects!**
uk: ** Хороша документація важлива для навчальних проектів! **

source: Overview
uk: Огляд

source: БАБАЙ documentation includes:
uk: Бабай Документація включає:

source: **User Guides** - For students and teachers
uk: ** Посібники користувача ** - для учнів та викладачів

source: **Developer Docs** - For contributors
uk: ** Документи розробників ** - для учасників

source: **API Reference** - For library users
uk: ** Довідка API ** - для користувачів бібліотеки

source: **Tutorials** - Step-by-step learning
uk: ** Підручники **-покрокове навчання

source: **Translations** - Multi-language support
uk: ** Переклади ** - Багатомовна підтримка

source: All documentation must be:
uk: Вся документація повинна бути:

source: ✅ **Clear** - Easy to understand ✅ **Complete** - Cover all aspects ✅ **Accurate** - Technically correct ✅ **Accessible** - Well-structured ✅ **Translated** - Available in EN, UK, RU
uk: ✅ ** Очистити ** - Легко для розуміння ✅ ** Повна ** - покрийте всі аспекти ✅ ** Точні ** - Технічно правильне ✅ ** Доступно ** - Добре структурований ✅ ** Переклад ** - Доступно в EN, Великобританія, Ru

source: Documentation Stack
uk: Стек документації

source: We use:
uk: Ми використовуємо:

source: **Sphinx** - Documentation generator
uk: ** Сфінкс ** - Генератор документації

source: **reStructuredText** - Markup language
uk: ** RebertructureDText ** - Мова розмітки

source: **ReadTheDocs** - Hosting platform
uk: ** Readthedocs ** - Хостингова платформа

source: **sphinx-intl** - Translation management
uk: ** Sphinx -intl ** - Управління перекладом

source: **Git** - Version control
uk: ** git ** - контроль версії

source: Requirements
uk: Вимоги

source: Writing Style
uk: Стиль письма

source: **For User Documentation:**
uk: ** Для документації користувача: **

source: Use simple, clear language
uk: Використовуйте просту, чітку мову

source: Avoid technical jargon
uk: Уникайте технічного жаргону

source: Provide examples
uk: Наведіть приклади

source: Use active voice
uk: Використовуйте активний голос

source: Keep sentences short
uk: Зберігайте речення короткими

source: **For Technical Documentation:**
uk: ** Для технічної документації: **

source: Be precise and accurate
uk: Бути точним і точним

source: Define terms
uk: Визначте терміни

source: Include code examples
uk: Включіть приклади коду

source: Reference related docs
uk: Довідкові документи

source: Use proper formatting
uk: Використовуйте належне форматування

source: Structure
uk: Структура

source: Each document should have:
uk: Кожен документ повинен мати:

source: **Title** - Clear, descriptive
uk: ** заголовок ** - чіткий, описовий

source: **Overview** - Brief introduction
uk: ** Огляд ** - Короткий вступ

source: **Prerequisites** - What reader needs to know
uk: ** Передумови ** - Що читач повинен знати

source: **Main Content** - Detailed information
uk: ** Основний вміст ** - Детальна інформація

source: **Examples** - Practical demonstrations
uk: ** Приклади ** - практичні демонстрації

source: **Troubleshooting** - Common issues
uk: ** Усунення несправностей ** - Загальні проблеми

source: **Next Steps** - Where to go next
uk: ** Наступні кроки ** - куди йти далі

source: Formatting
uk: Форматування

source: Use proper reStructuredText:
uk: Використовуйте належне реструктуризацію:

source: Content Guidelines
uk: Керівні принципи змісту

source: Images
uk: Зображення

source: Use high-quality screenshots
uk: Використовуйте якісні скріншоти

source: Add descriptive captions
uk: Додати описові підписи

source: Optimize file sizes
uk: Оптимізуйте розміри файлів

source: Place in ``_static/images/``
uk: Місце в `` _static/зображення/`` ``

source: Reference properly
uk: Посилання належним чином

source: Code Blocks
uk: Кодові блоки

source: Always specify language:
uk: Завжди визначте мову:

source: Links
uk: Посилання

source: **Internal links:**
uk: ** Внутрішні посилання: **

source: **External links:**
uk: ** Зовнішні посилання: **

source: Lists
uk: Списки

source: Tables
uk: Столи

source: Translation Workflow
uk: Робочий процес перекладу

source: БАБАЙ docs are available in 3 languages:
uk: Бабай документів доступні на 3 мовах:

source: **English (en)** - Primary language
uk: ** Англійська (en) ** - Первинна мова

source: **Ukrainian (uk)** - Рідна мова
uk: ** Український (Великобританія) ** - rіdna moua

source: Translation Process
uk: Процес перекладу

source: **Extract Translatable Strings**
uk: ** Екстракт перекладею **

source: **Update Translation Catalogs**
uk: ** Каталоги перекладу оновлення **

source: **Translate .po Files**
uk: ** Перекладіть .po файли **

source: Edit files in ``docs/locale/[lang]/LC_MESSAGES/``
uk: Редагувати файли в `` docs/locale/[lang]/lc_messages/`` `

source: **Build Translated Docs**
uk: ** Побудувати перекладені документи **

source: Translation Guidelines
uk: Керівні принципи перекладу

source: Keep technical terms consistent
uk: Зберігайте технічні умови послідовними

source: Preserve formatting (``**bold**``, code blocks)
uk: Зберігайте форматування (`` ** BOLD ** ``, блоки коду)

source: Don't translate code examples
uk: Не перекладіть приклади коду

source: Translate comments in code
uk: Перекладіть коментарі в коді

source: Review translations before committing
uk: Перегляньте переклади перед вчиненням

source: Development Setup
uk: Налаштування розвитку

source: **Clone Repository**
uk: ** Клон -сховище **

source: **Install Dependencies**
uk: ** Встановіть залежності **

source: **Test Local Build**
uk: ** Перевірте місцеву збірку **

source: **Create Branch**
uk: ** Створити гілку **

source: Making Changes
uk: Внесення змін

source: Workflow
uk: Робочий процес

source: **Edit .rst Files**
uk: ** редагувати .rst файли **

source: Use any text editor
uk: Використовуйте будь -який текстовий редактор

source: **Build Locally**
uk: ** Побудувати локально **

source: **Check for Errors**
uk: ** Перевірте наявність помилок **

source: Fix any warnings or errors
uk: Виправити будь -які попередження або помилки

source: **Preview Changes**
uk: ** Зміни попереднього перегляду **

source: Open in browser to verify
uk: Відкрити в браузері для перевірки

source: **Commit Changes**
uk: ** Викладати зміни **

source: **Push and Create PR**
uk: ** Натисніть і створіть PR **

source: Submission Process
uk: Процес подання

source: **Proposal**
uk: ** Пропозиція **

source: For major changes, open GitHub Issue first:
uk: Для основних змін спочатку відкритим випуск Github:

source: Describe what you want to improve
uk: Опишіть, що ви хочете вдосконалити

source: Explain why it's needed
uk: Поясніть, чому це потрібно

source: **Make Changes**
uk: ** внести зміни **

source: Follow style guidelines
uk: Дотримуйтесь вказівок стилю

source: Build and test locally
uk: Будуйте та тестуйте локально

source: Check for broken links
uk: Перевірте наявність зламаних посилань

source: **Submit PR**
uk: ** Надіслати PR **

source: Include in PR description:
uk: Включіть в опис PR:

source: What was changed
uk: Що змінилося

source: Why it was changed
uk: Чому це було змінено

source: Screenshots (if visual changes)
uk: Скріншоти (якщо візуальні зміни)

source: **Review**
uk: ** Огляд **

source: Maintainers will:
uk: Службові працівники будуть:

source: Check accuracy
uk: Перевірте точність

source: Verify formatting
uk: Перевірте форматування

source: Test builds
uk: Тестові конструкції

source: Provide feedback
uk: Надайте зворотній зв'язок

source: **Merge**
uk: ** Злиття **

source: Once approved, changes are merged
uk: Після затвердження зміни об'єднуються

source: Quality Checklist
uk: Контрольний список якості

source: Before submitting:
uk: Перед поданням:

source: [ ] Content is accurate
uk: [] Вміст точний

source: [ ] Spelling and grammar checked
uk: [] Орфографічна та граматика перевірили

source: [ ] Code examples tested
uk: [] Приклади коду

source: [ ] Images optimized
uk: [] Зображення оптимізовані

source: [ ] Links work
uk: [] Посилання працюють

source: [ ] Builds without warnings
uk: [] Будує без попереджень

source: [ ] Follows style guide
uk: [] Слідує посібник із стилю

source: [ ] Translations updated (if applicable)
uk: [] Переклади оновлені (якщо застосовуються)

source: [ ] Preview looks correct
uk: [] Попередній перегляд виглядає правильно

source: Common Tasks
uk: Поширені завдання

source: Adding New Page
uk: Додавання нової сторінки

source: Create ``.rst`` file in ``docs/``
uk: Створити файл `` .rst`` 'у `` docs/`` `` `

source: Add to ``toctree`` in ``index.rst``
uk: Додати до `` toctree`` в `` index.rst``````

source: Build and verify
uk: Будувати та перевірити

source: Commit and submit
uk: Здійснити та подати

source: Updating Existing Page
uk: Оновлення існуючої сторінки

source: Edit ``.rst`` file
uk: Редагувати файл `` .rst``

source: Build locally
uk: Побудувати місцево

source: Verify changes
uk: Перевірте зміни

source: Update translations if needed
uk: Оновіть переклади, якщо потрібно

source: Adding Images
uk: Додавання зображень

source: Place image in ``docs/_static/images/``
uk: Розмістіть зображення в `` docs/_static/зображення/`` `` ``

source: Optimize size (< 500KB)
uk: Оптимізуйте розмір (<500 кб)

source: Reference in ``.rst`` file
uk: Довідка у файлі `` .rst``

source: Add descriptive alt text
uk: Додати описовий текст Alt

source: Test rendering
uk: Тестування

source: Fixing Broken Links
uk: Виправлення зламаних посилань

source: Identify broken link
uk: Визначте зламане посилання

source: Update or remove
uk: Оновити або видалити

source: Check related pages
uk: Перевірте пов’язані сторінки

source: Commit fix
uk: Здійснити виправлення

source: Troubleshooting
uk: Усунення несправностей

source: Build Errors
uk: Побудувати помилки

source: **"WARNING: document isn't included in any toctree"**
uk: ** "ПОПЕРЕДЖЕННЯ: Документ не включається в будь -який Toctree " **

source: Add document to ``index.rst`` toctree
uk: Додати документ до `` index.rst`` 'toctree

source: **"WARNING: undefined label"**
uk: ** "Попередження: невизначена мітка " **

source: Check reference targets exist
uk: Перевірте довідкові цілі існують

source: Fix typos in references
uk: Виправити помилки в посиланнях

source: **"ERROR: Unknown directive type"**
uk: ** "Помилка: Невідомий тип директиви " **

source: Check directive spelling
uk: Перевірте Директиву правопис

source: Ensure extensions loaded in ``conf.py``
uk: Забезпечте розширення, завантажені в `` conf.py``

source: Translation Issues
uk: Проблеми з перекладом

source: **Missing translations:**
uk: ** Відсутні переклади: **

source: **Encoding errors:**
uk: ** Помилки кодування: **

source: Ensure .po files are UTF-8
uk: Переконайтесь.

source: Check for special characters
uk: Перевірте наявність спеціальних символів

source: Tools
uk: Інструменти

source: Recommended Editors
uk: Рекомендовані редактори

source: **VS Code** - With reStructuredText extension
uk: ** проти коду ** - з розширенням RecorductureDText

source: **Sublime Text** - With RST plugins
uk: ** Піднесений текст ** - з RST плагінами

source: **PyCharm** - Built-in RST support
uk: ** Pycharm ** - вбудована підтримка

source: **Vim/Emacs** - With RST modes
uk: ** vim/emacs ** - з режимами RST

source: Translation Tools
uk: Інструменти перекладу

source: **Poedit** - GUI for .po files
uk: ** poedit ** - gui for .po файлів

source: **Lokalize** - KDE translation tool
uk: ** Lokalize ** - інструмент перекладу KDE

source: **Text editor** - Manual editing
uk: ** Текстовий редактор ** - Редагування вручну

source: Resources
uk: Ресурси

source: **Sphinx Documentation** - https://www.sphinx-doc.org/
uk: ** Документація Сфінкса ** - https://www.sphinx-doc.org/

source: **reStructuredText Primer** - https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html
uk: ** Primer RescortuctureDText ** - https: //www.sphinx- doc.org/en/master/usage/restructuredtext/basics.html

source: **ReadTheDocs Guide** - https://docs.readthedocs.io/
uk: ** Посібник з readthedocs ** - https://docs.readthedocs.io/

source: **Developer Guide** - See ``guides/development/`` in repository
uk: ** Посібник для розробників ** - див. `` Посібники/Розробка/`` у сховищі

source: Examples
uk: Приклади

source: Good Documentation Examples:
uk: Хороші приклади документації:

source: Clear installation instructions
uk: Чіткі інструкції з установки

source: Step-by-step tutorials with images
uk: Покрокові підручники із зображеннями

source: Complete API references
uk: Повні посилання API

source: Troubleshooting guides
uk: Посібники з усунення несправностей

source: Questions?
uk: Питання?

source: Open GitHub Issue with tag ``documentation``
uk: Відкрийте проблему Github з тегом `` Документація``

source: Contact ``@vergilium``
uk: Зверніться до ``@vergilium``

source: Join documentation discussion
uk: Приєднуйтесь до обговорення документації

source: :doc:`Back to Contributing Overview <contributing>`
uk: : doc: `Повернутися до огляду <plosing>` `
