Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: ru, uk

source: Contributing to БАБАЙ Project
ru: Внесение вклад в проект БАБАЙ.DIY
uk: Внесок до проекту БАБАЙ.DIY (ByByte)

source: Thank you for your interest in contributing to БАБАЙ!
ru: Спасибо за заинтересованность в внесении вклад в БАБАЙ.DIY!
uk: Дякуємо вам за інтерес до проекту БАБАЙ.DIY!

source: **⚠️ IMPORTANT: Discuss Before Contributing**
ru: **⚠️ ВАЖНО: обсудить, прежде чем вносить изменения**
uk: **⚠️ ВАЖЛИВО: Обговоріть про свої наміри перед роботою над внеском!**

source: **Before making any changes or adding new contributions, you MUST communicate and coordinate your intentions with project moderators.**
ru: **Прежде чем вносить какие -либо изменения или добавить новые взносы, вы должны сообщить и координировать свои намерения с модераторами проекта.**
uk: ** Перш ніж внести будь -які зміни або додавання нових внесків, ви повинні спілкуватися та координувати свої наміри з модераторами проекту. ****Перед тим як вносити правки, додавати нові внески, повідомте та узгодьте ваші наміри з модератором.**

source: This ensures:
ru: Это гарантирует:
uk: Це дасть нам:

source: Your efforts align with project goals
ru: Ваши усилия согласованы с целями проекта
uk: Розуміння руху проекту

source: We can guide your skills in the right direction
ru: Мы можем направить ваши навыки в правильном направлении
uk: Можливість направити ваші вміння та бажання в вірному напрямку

source: Maximum benefit for both you and the project
ru: Максимальная выгода как для вас, так и для проекта
uk: Максимальний ефект як для проекту, так і для кожного контриб'ютора

source: Your work will not be wasted
ru: Ваша работа не будет потрачена впустую
uk: Впевненість, що ваші старання не будуть марними

source: **We value every contribution and want your efforts to be meaningful!**
ru: **Мы ценим каждый вклад и хотим, чтобы ваши усилия были значимыми!**
uk: ** Ми цінуємо кожен внесок і хочемо, щоб ваші зусилля були значущими! ****Ми цінимо кожний внесок, та хочемо щоб ваші старання не були марними.**

source: About БАБАЙ Project
ru: О проекте БАБАЙ.DIY
uk: Про проект БАБАЙ.DIY

source: БАБАЙ is an open educational robotics platform consisting of:
ru: БАБАЙ.DIY - это открытая образовательная платформа робототехники, состоящая из:
uk: БАБАЙ.DIY, це відкрита робо платформа для навчання яка включає:

source: **Hardware platforms** (БАБАЙ nano and БАБАЙ Mega)
ru: **Аппаратные платформы** (БАБАЙ nano и БАБАЙ Mega)
uk: **Роботизовану платформу** (БАБАЙ nano та БАБАЙ Mega)

source: **Educational curriculum** (lessons and workshops)
ru: **Образовательная учебная программа** (уроки и семинары)
uk: **Навчальна программа** (Уроки і семінари)

source: **Software libraries** and tools
ru: **Библиотеки программного обеспечения** и инструменты
uk: **Програмні бібліотеки** та інструменти

source: **Documentation** for users and developers
ru: **Документация** для пользователей и разработчиков
uk: **Документацію** для користувачів та розробників

source: **Community website** and resources
ru: **WEB-сайт сообщества** и ресурсы
uk: **WEB-site спільноти** та ресурси

source: All contributions must meet project quality standards and educational goals.
ru: Все правки должны соответствовать стандартам качества проекта и образовательным целям.
uk: Усі внески повинні відповідати стандартам якості проекту та навчальним цілям.Усі внески повинні відповідати стандартам якості проекту та навчальним цілям.

source: How to Contribute
ru: Как внести свой вклад
uk: Як допомогти:

source: Step 1: Discuss Your Ideas
ru: Шаг 1: Обсудите свои идеи
uk: Крок 1: Обговоріть вашу ідею

source: **Before starting any work**, reach out to moderators:
ru: **Прежде чем начать какую - либо работу**, обратитесь к модераторам:
uk: **Перед початком роботи**, зверніться до модераторів:

source: **Open a Discussion**
ru: **Откройте обсуждение**
uk: **Відкрийте обговорення**

source: Go to `GitHub Discussions <https://github.com/vergilium/ByByte/discussions>`_
ru: Перейдите к `GitHub Discussions <https://github.com/vergilium/ByByte/discussions>`_
uk: Перейдіть на `github Dustaries <https://github.com/vergilium/bybyte/discusssions>` _Перейдіть до `GitHub Discussions <https://github.com/vergilium/ByByte/discussions>`_

source: Describe what you want to contribute
ru: Опишите, что вы хотите сделать
uk: Опишіть, що ви хочете зробити в своєму внесоку

source: Explain why it's beneficial
ru: Объясните, полезность ваших идей
uk: Поясніть переваги

source: Wait for approval from maintainers
ru: Дождитесь одобрения со стороны майтейнеров
uk: Зачекайте схвалення

source: **Create an Issue**
ru: **Создайте Issue**
uk: **Створіть Issue**

source: Go to `GitHub Issues <https://github.com/vergilium/ByByte/issues>`_
ru: Перейдите к `GitHub Issues <https://github.com/vergilium/ByByte/issues>`_
uk: Перейдіть до `github проблем <https://github.com/vergilium/bybyte/issues>` _Перейдіть до `GitHub Issues <https://github.com/vergilium/ByByte/issues>`_

source: Use "Contribution Proposal" template
ru: Используйте шаблон "Contribution Proposal"
uk: Використовуйте шаблон "Contribution Proposal"

source: Provide detailed description
ru: Укажите подробное описание
uk: Додайте детальний опис

source: Tag ``@vergilium`` for review
ru: Отметьте ``@vergilium`` для обзора
uk: Тегніть ``@vergilium`` для перевірки

source: **Join Community Chat**
ru: **Присоединяйтесь к чату сообщества**
uk: **Приєднайтесь до чату спільноти**

source: Contact project maintainers directly
ru: Свяжитесь с сопровождающими проекта напрямую
uk: Контактуйте з майтейнерами проекту безпосередньо

source: Discuss your plans and get guidance
ru: Обсудите свои планы и получите руководство
uk: Обговоріть ваші плани та отримайте інструкції

source: **Only after receiving approval, proceed with your contribution!**
ru: **Только после получения одобрения, приступите к своему вкладу в проект!**
uk: **Лише після отримання схвалення продовжуйте свій внесок!**

source: Step 2: Choose Contribution Area
ru: Шаг 2: Выберите область вашего вклада
uk: Крок 2: Виберіть область внеску

source: Select the area where you want to contribute:
ru: Выберите область, в которой вы хотите внести свой вклад в проект:
uk: Виберіть область, де ви хочете зробити внесок:

source: 🤖 **Hardware Development**
ru: 🤖 **Разработка оборудования**
uk: 🤖 **Розробка обладнання **

source: Design and improve robot platforms (БАБАЙ nano, БАБАЙ Mega)
ru: Проектируйте и улучшайте роботизированные платформы (БАБАЙ nano, БАБАЙ Mega)
uk: Дизайн та вдосконалення роботів -платформ (Бабай Нано, Баба Мега)

source: See: :doc:`contributing-hardware`
ru: См.: :doc:`contributing-hardware`
uk: Див. :doc: `contributing-hardware`

source: 📚 **Educational Content**
ru: 📚 **Образовательный контент**
uk: 📚 **Освітній контент**

source: Create lessons, tutorials, and workshops
ru: Создавайте уроки, учебники и семинары
uk: Створіть уроки, навчальні посібники та воркшопи

source: See: :doc:`contributing-lessons`
ru: См.: :doc:`contributing-lessons`
uk: Див. :doc: `contributing-lessons`

source: 📖 **Documentation**
ru: 📖 **Документация**
uk: 📖 **Документація**

source: Improve guides, translate documentation
ru: Улучшайте руководства, помогайте перевести документацию
uk: Поліпшення путівників, перекладіть документацію

source: See: :doc:`contributing-documentation`
ru: См.: :doc:`contributing-documentation`
uk: Див. :doc: `contributing-documentation`

source: 🌐 **Website Development**
ru: 🌐 **Разработка WEB-сайта **
uk: 🌐 ** Розробка WEB-сайту **

source: Build and enhance project website
ru: Создавайте и улучшение веб-сайт проекта
uk: Будуйте та вдоскональте WEB-сайт проекту

source: See: :doc:`contributing-website`
ru: См.: :doc:`contributing-website`
uk: Див. :doc: `contributing-website`

source: 💻 **Software & Libraries**
ru: 💻 **Программное обеспечение и библиотеки**
uk: 💻 ** Програмне забезпечення та бібліотеки **

source: Develop code, libraries, and tools
ru: Разрабатывайте код, библиотеки и инструменты
uk: Розробляй код, бібліотеки та інструменти

source: See: :doc:`contributing-software`
ru: См.: :doc:`contributing-software`
uk: Див. :doc: `contributing-software`

source: Step 3: Follow Guidelines
ru: Шаг 3: Следуйте основным принципам
uk: Крок 3: Дотримуйтесь вказівок

source: Each contribution area has specific requirements:
ru: Каждая область внесения вклада имеет определенные требования:
uk: Кожна область внеску має конкретні вимоги:

source: **Quality standards** - All work must meet project standards
ru: **Стандарты качества** - Все работы должны соответствовать стандартам проекта
uk: **Стандарти якості** - Усі роботи повинні відповідати стандартам проекту

source: **Educational focus** - Content must support learning goals
ru: **Фокус на образование** - Контент должен поддерживать цели обучения
uk: **Освітній фокус** - Зміст повинен підтримувати цілі навчання

source: **Review process** - All contributions reviewed by maintainers
ru: **Проверка** - Все вклады, проверяются майтейнерами
uk: **Процес перевірки** - Усі внески, перевіряються маінтейнерами

source: **Testing** - Hardware and software must be tested
ru: **Тестирование** - аппаратное и программное обеспечение должно быть протестировано
uk: **Тестування** - Апаратне та програмне забезпечення повинно бути перевіреним

source: **Documentation** - All features must be documented
ru: **Документация** - Все функции должны быть задокументированы
uk: **Документація** - Усі функції повинні бути задокументовані

source: **All new lessons and educational content MUST be reviewed and approved by moderators before publication.**
ru: **Все новые уроки и образовательный контент должны быть рассмотрены и утверждены модераторами до публикации.**
uk: **Усі нові уроки та навчальний зміст повинні бути переглянуті та затверджені модераторами перед публікацією.**

source: General Requirements
ru: Общие требования
uk: Загальні вимоги

source: For All Contributors
ru: Для всех участников
uk: Для всіх учасників

source: ✅ **Communication**
ru: ✅ **Общение**
uk: ✅ **Спілкування**

source: Discuss before starting work
ru: Обсудите все перед началом работы
uk: Обговоріть перед початком роботи

source: Respond to feedback
ru: Получите ответ по вашему запросу
uk: Дочекайтесь відповіді

source: Ask questions if unclear
ru: Задайте вопросы если что то не ясно
uk: Задайте питання, якщо щось незрозуміло

source: ✅ **Quality**
ru: ✅ **Качество**
uk: ✅ **Якість**

source: Follow project standards
ru: Следуйте стандартам проекта
uk: Дотримуйтесь стандартів проекту

source: Test your work thoroughly
ru: Тщательно проверяйте свою работу
uk: Ретельно перевіряйте свою роботу

source: Provide clear documentation
ru: Предоставьте четкую документацию
uk: Надайте чітку документацію

source: ✅ **Educational Value**
ru: ✅ **Значимость в образовании**
uk: ✅ **Освітня цінність**

source: Consider learning objectives
ru: Рассмотрите цели обучения
uk: Розгляньте цілі навчання

source: Make content accessible
ru: Сделайте контент доступным
uk: Зробіть вміст доступним

source: Support different skill levels
ru: Поддерживйте разные уровни квалификации
uk: Підтримуйте різні рівні навичок

source: ✅ **Open Source Spirit**
ru: ✅ **Открытость**
uk: ✅ **Відкритість платформи**

source: Share knowledge
ru: Делитесь знаниями
uk: Ділитися знаннями

source: Help others
ru: Помогите другим
uk: Допоможіть іншим

source: Be respectful
ru: Будьте уважительны
uk: Майте повагу до інших

source: Git Workflow
ru: Рабочий процесс Git

source: **Fork the repository**
ru: **Сделайте Fork репозитория**
uk: **Зробіть Fork репозиторію**

source: **Create a branch**
ru: **Создайте ветвь**
uk: **Створіть гілку**

source: **Make your changes**
ru: **Внесите изменения**
uk: **Внесіть свої зміни**

source: **Commit with clear messages**
ru: **Сделайте commit с четким описанием**
uk: **Зробіть commit з зрозумілим описом**

source: **Push and create Pull Request**
ru: **Создайте Pull request**
uk: **Зробіть Pull request**

source: **Respond to review feedback**
ru: **Дождитесь ответа от ревъювера**
uk: **Очікуйте на рев'ю ваших змін**

source: Address all comments
ru: Пересмотрите к все комментарии к вашей работе
uk: Виправіть всі зауваження

source: Make requested changes
ru: Внесите правки и изменения
uk: Створіть запит на зміни

source: Update documentation
ru: Обновите документацию
uk: Оновіть документацію

source: Commit Message Guidelines
ru: Рекомендации по описаниям комитов
uk: Примініть всі рекомендації

source: Good commit messages:
ru: Хорошие сообщения о коммите:
uk: Хороші повідомлення для комітів:

source: Format:
ru: Формат:
uk: Формат:

source: Use present tense ("Add" not "Added")
ru: Используйте настоящее время ("Add" не "Added")
uk: Використовуйте теперішній час ("Add " не "Added")

source: Use imperative mood ("Move" not "Moves")
ru: Используйте императивное настроение ("Move" не "Moves")
uk: Використовуйте наказовий спосіб ("Move" не "Moves ")

source: First line ≤ 72 characters
ru: Первая строка ≤ 72 символа
uk: Перший рядок ≤ 72 символи

source: Reference issues
ru: Ссылки на issues
uk: Пов'язуйте issues

source: Code Review Process
ru: Процесс проверки кода
uk: Процес перегляду коду

source: All contributions go through review:
ru: Все правки проходят проверку:
uk: Усі внески проходять через огляд:

source: **Maintainer Review**
ru: **Заключение майнтейнера**
uk: **Огляд майнтейнерами**

source: Check alignment with project goals
ru: Проверка согласования с целями проекта
uk: Перевірте узгодження з цілями проекту

source: Verify educational value
ru: Проверка образовательной ценности
uk: Перевірте навчальну цінність

source: Test functionality
ru: Функциональность тестирования
uk: Функціональність тесту

source: Review documentation
ru: Просмотр документации
uk: Перегляд документації

source: **Technical Review**
ru: **Технический обзор**
uk: **Технічний огляд**

source: Code quality
ru: Качество кода
uk: Якість коду

source: Hardware design
ru: Аппаратный дизайн
uk: Дизайн обладнання

source: Safety considerations
ru: Соображения безопасности
uk: Міркування безпеки

source: Compatibility
ru: Совместимость
uk: Сумісність

source: **Educational Review**
ru: **Образовательный обзор**
uk: **Огляд освіти**

source: Learning objectives clear
ru: Ясные цели для обучения
uk: Цілі навчання чіткі

source: Age-appropriate content
ru: Содержание соответствующее возрасту
uk: Вміст, що відповідає віку

source: Practical applicability
ru: Практическая применимость
uk: Практична застосовність

source: Proper difficulty level
ru: Правильный уровень сложности
uk: Належний рівень складності

source: **Approval**
ru: **Одобрение**
uk: **Схвалення**

source: All feedback addressed
ru: Все замечания исправлены
uk: Всі зауваження виконані

source: Tests passing
ru: Тесты проходят
uk: Тести, що проходять

source: Documentation complete
ru: Документация полная
uk: Документація завершена

source: Merged to main branch
ru: Объединен в главную ветку
uk: Об'єднаний до головної гілки

source: Quality Standards
ru: Стандарты качества
uk: Стандарти якості

source: Hardware
ru: Аппаратное обеспечение
uk: Обладнання

source: Use common, affordable components
ru: Используйте общие, доступные компоненты
uk: Використовуйте загальні, доступні компоненти

source: Provide clear assembly instructions
ru: Предоставте четкие инструкции по сборке
uk: Надайте чіткі інструкції зі складання

source: Include safety warnings
ru: Включите предупреждения о безопасности
uk: Включіть попередження безпеки

source: Test all designs
ru: Проверьте все конструкции
uk: Перевірте всі конструкції

source: Software
ru: Программное обеспечение
uk: Програмне забезпечення

source: Follow coding standards
ru: Следуйте стандартам написания кода
uk: Дотримуйтесь стандартів кодування

source: Include comments
ru: Включите комментарии
uk: Включіть коментарі

source: Write tests
ru: Напишите тесты
uk: Напишіть тести

source: Provide examples
ru: Добавьте примеры
uk: Наведіть приклади

source: Educational Content
ru: Образовательный контент
uk: Навчальний зміст

source: Clear learning objectives
ru: Четкие цели обучения
uk: Чіткі цілі навчання

source: Step-by-step instructions
ru: Пошаговые инструкции
uk: Покрокові інструкції

source: Age-appropriate language
ru: Подходящее к возрасту описание
uk: Текст відповідає віку

source: Practical examples
ru: Практические примеры
uk: Практичні приклади

source: Safety information
ru: Информация о безопасности
uk: Інформація про безпеку

source: Documentation
ru: Документация
uk: Документація

source: Clear and concise
ru: Ясно и лаконично
uk: Чіткий і стислий

source: Include images/diagrams
ru: Включите изображения/диаграммы
uk: Включіть зображення/схеми

source: Multiple languages (EN, UK, RU)
ru: Несколько языков (EN, UA, RU)
uk: Кілька мов (EN, UA, RU)

source: Community Guidelines
ru: Правила сообщества
uk: Правила спільноти

source: 🤝 **Be Respectful**
ru: 🤝 **Относитесь уважительно**
uk: 🤝 **Будьте вічливі**

source: Treat everyone with respect
ru: Относитесь ко всем с уважением
uk: Ставтеся до всіх з повагою

source: Welcome newcomers
ru: Приветствуйте новичков
uk: Ласкаво просимо новачків

source: Be patient and helpful
ru: Будьте терпеливы и полезны
uk: Будьте терплячі та допомагайте

source: 💡 **Be Collaborative**
ru: 💡 **Будьте готовы к сотрудничеству**
uk: 💡 **Будьте колаборативним**

source: Help others learn
ru: Помогайте другим учиться
uk: Допоможіть іншим вчитися

source: Give constructive feedback
ru: Давайте конструктивную обратную связь
uk: Надавайте конструктивні відгуки

source: 📚 **Be Educational**
ru: 📚 **Будьте образованы**
uk: 📚 **Будьте повчальними**

source: Focus on learning
ru: Сосредоточтесь на обучении
uk: Зосередьтеся на навчанні

source: Explain your decisions
ru: Объясните свои решения
uk: Поясніть свої рішення

source: Create accessible content
ru: Создавайте доступный контент
uk: Створіть доступний вміст

source: 🌟 **Be Open**
ru: 🌟 **Будьте открытым**
uk: 🌟 **Будьте відкритими**

source: Share your work
ru: Поделитесь своей работой
uk: Поділіться своєю роботою

source: Accept feedback
ru: Воспринимайте отзывы и конструктивную критику
uk: Прийміть відгук

source: Iterate and improve
ru: Интегрируйте и улучшайте
uk: Рухайтесь та вдосконалюйте

source: Getting Help
ru: Получайте помощь
uk: Отримуйте допомогу

source: Need assistance?
ru: Нужна помощь?
uk: Потрібна допомога?

source: 💬 **GitHub Discussions** - Ask questions, share ideas
ru: 💬 **Обсуждения GitHub** - Задайте вопросы, поделитесь идеями
uk: 💬 ** GitHub Discussions** - Задавайте питання, діліться ідеями

source: 🐛 **GitHub Issues** - Report bugs, request features
ru: 🐛 **GitHub issues** - Документируйте ошибки, расширяйте функционал
uk: 🐛 **GitHub Issues** - Повідомте про помилки, створюйте нові можливості

source: 📧 **Maintainers** - Contact project leads
ru: 📧 **Содействия** - Контактируйте с ведущими проекта
uk: 📧 **Maintainers** - Звертайтесь до лідерів проекту

source: 📖 **Documentation** - Read detailed guides
ru: 📖 **Документация** - Читайте подробные руководства
uk: 📖 **Documentation** - Читайте детальні інструкції

source: Recognition
ru: Признание
uk: Визнання

source: All contributors will be:
ru: Все участники будут:
uk: Усі учасники будуть:

source: ✨ Listed in project contributors
ru: ✨ Зарегистрированы в участниках проекта
uk: ✨ Перераховано в учасниках проектів

source: 📝 Credited in release notes
ru: 📝 Указаны в примечаниях к выпуску
uk: 📝 Вказано в примітках до випуску

source: 🎓 Part of educational impact
ru: 🎓 Будут частью образовательного процесса
uk: 🎓 Частина навчального впливу

source: 🌍 Building better learning tools
ru: 🌍 Создавать лучшие инструменты обучения
uk: 🌍 Створення кращих інструментів навчання

source: License
ru: Лицензия
uk: Ліцензія

source: By contributing, you agree that your contributions will be licensed under the same license as the project.
ru: Способствуя, вы соглашаетесь с тем, что ваши внесенные усилия будут лицензироваться по той же лицензии, что и проект.
uk: Вносячи внесок, ви погоджуєтесь, що ваші внески будуть ліцензовані за тією ж ліцензією, що і проект.

source: Next Steps
ru: Следующие шаги
uk: Наступні кроки

source: Ready to contribute? Choose your area:
ru: Готовы внести свой вклад? Выберите свою область:
uk: Готові внести свій внесок? Виберіть свою область:

source: **Thank you for helping make БАБАЙ better!**
ru: **Спасибо, что помогли сделать БАБАЙ.DIY лучше! **
uk: **Дякую, що допомагаєте зробити "БАБАЙ.DIY" кращим!**

source: 🚀 Together we build the future of education! 🚀
ru: 🚀 Вместе мы строим будущее образования! 🚀
uk: 🚀 Разом ми будуємо майбутнє освіти! 🚀
