Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru, uk

source: Home
ru: Главная
uk: Головна

source: Contents:
ru: Содержание:
uk: Зміст:

source: Getting Started:
ru: Начало работы:
uk: Початок роботи:

source: User Guide:
ru: Руководство пользователя:
uk: Посібник користувача:

source: Additional Information:
ru: Дополнительная информация:
uk: Додаткова інформація:

source: Contributing to БАБАЙ:
ru: Вклад в БАБАЙ.DIY:
uk: Внески до БАБАЙ.DIY:

source: БАБАЙ (ByByte) - Educational Robotics Platform
ru: БАБАЙ.DIY (bybyte) - платформа образовательной робототехники
uk: БАБАЙ.DIY (ByByte) - Освітня робототехнічна платформа

source: Welcome to БАБАЙ documentation! An open-source educational robotics platform for teaching programming and robotics to students and children.
ru: Добро пожаловать в документацию "БАБАЙ"! Платформа образовательной робототехники с открытым исходным кодом для обучения программированию и робототехники школьников и студентов.
uk: Ласкаво просимо до документації Баба! Платформа для навчальної робототехніки з відкритим кодом для викладання програмування та робототехніки для студентів та дітей.Ласкаво просимо до документації БАБАЙ! Відкрита освітня робототехнічна платформа для навчання програмуванню та робототехніці студентів і дітей.

source: 📚 **Before using the platform or building a robot, please read this documentation carefully!**
ru: 📚 **Перед использованием платформы и создания робота, пожалуйста, внимательно прочитайте эту документацию!**
uk: 📚 **Перед тим, як використовувати платформу або побудувати робота, будь ласка, уважно прочитайте цю документацію!**

source: About the Project
ru: О проекте
uk: Про проект

source: **БАБАЙ** is an open educational project aimed at teaching school-age children and students robotics and programming through practical tasks.
ru: **БАБАЙ.DIY** -это открытый образовательный проект, предназначенный для обучения детей школьного возраста и и студентов программированию с помощью практических задач.
uk: **БАБАЙ.DIY**-це відкритий навчальний проект, спрямований на навчання дітей шкільного віку та учнів робототехніки та програмування за допомогою практичних завдань.

source: The foundation of the project consists of:
ru: Фонд проекта состоит из:
uk: Підгрунтя проекту складається з:

source: **🤖 Robotic Platforms**
ru: **🤖 Роботизированные платформы**
uk: **🤖 Робототехнічні платформи**

source: Two levels of complexity for different skill levels:
ru: Два уровня сложности для разных уровней квалификации:
uk: Два рівні складності для різних рівнів навичок:

source: **БАБАЙ nano** - Simple platform for beginners and home learning
ru: **БАБАЙ nano** - Простая платформа для начинающих и обучения дома
uk: **БАБАЙ nano** - Проста платформа для початківців та домашнього навчання

source: Easy to assemble without professional skills
ru: Легко собираться без профессиональных навыков
uk: Легко зібрати без професійних навичок

source: No special equipment required
ru: Не требуется специальное оборудование
uk: Не потрібне спеціальне обладнання

source: Uses common, affordable components
ru: Использует общиедоступные компоненты
uk: Використовує поширені, доступні компоненти

source: Perfect for individual learning at home
ru: Идеально подходит для индивидуального обучения дома
uk: Ідеально для індивідуального навчання вдома

source: **БАБАЙ Mega** - Advanced platform with maximum peripherals
ru: **БАБАЙ Mega** - Расширенная платформа с максимум периферии и датчиков
uk: **БАБАЙ Mega** - Професійна платформа з максимальним набором периферії

source: Professional-grade robotics platform
ru: Роботизированная платформа профессионального уровня
uk: Платформа робототехніки професійного класу

source: Full set of sensors and modules
ru: Полный набор датчиков и модулей
uk: Повний набір датчиків та модулів

source: Ideal for schools and educational institutions
ru: Идеально подходит для школ и учебных заведений
uk: Ідеально підходить для шкіл та навчальних закладів

source: Great for robotics clubs and workshops
ru: Отлично подходит для клубов и воркшопов с робототехники
uk: Чудово підходить для клубів та семінарів для робототехніки

source: **📚 Educational Curriculum**
ru: **📚 Образовательная учебная программа**
uk: **📚 Навчальна програма**

source: Structured lessons designed by robotics teachers and IT professionals
ru: Структурированные уроки, разработанные учителями робототехники и IT-специалистами
uk: Структуровані уроки, розроблені викладачами робототехніки та ІТ -фахівцями

source: Different difficulty levels for various skill levels
ru: Различные уровни сложности для различных уровней навыков
uk: Різні рівні складності для різних рівнів майстерності

source: Practical, hands-on approach to learning
ru: Практический подход к обучению
uk: Практичний, практичний підхід до навчання

source: All new lessons reviewed and approved by moderators
ru: Все новые уроки пересматриваются и утверждены модераторами
uk: Усі нові уроки, переглянуті та затверджені модераторами

source: **🎯 STEM Approach**
ru: **🎯STEM -подход**
uk: **🎯 STEM підхід**

source: Our methodology: **Practice First, Theory Second**
ru: Наша методология: **Сначала практика, затем теория**
uk: Наша методологія: ** Практикуйте спочатку, теорія друга **

source: **Build** - Assemble your robot (hands-on practice)
ru: **Сборка** – соберите своего робота (практические навыки).
uk: **Будуйте** - Зберіть свого робота (попрактикуйтесь)

source: **Program** - Learn theory through practical programming
ru: **Программа** - Изучайте теорию с помощью практического программирования
uk: **Програма** - Вивчайте теорію за допомогою практичного програмування

source: **Experiment** - Develop problem-solving skills
ru: **Эксперименты** - Развивайте навыки решения проблем
uk: **Експериментуй** - Вчись розвивати навички вирішення проблем

source: Project Goals
ru: Цели проекта
uk: Цілі проекту

source: Our mission is to **collectively build a high-quality platform** for learning programming, electronics, and robotics suitable for:
ru: Наша миссия состоит в том, чтобы **коллективно построить высококачественную платформу** для обучения программирования, электроники и робототехники, подходящих для:
uk: Наша місія полягає в тому, щоб **колективно побудувати високоякісну платформу** для навчання програмування, електроніки та робототехніки, для:

source: ✅ **Schools** - Complete curriculum for classroom teaching
ru: ✅ **Школ** - Полная учебная программа для обучения в классе
uk: ✅ **Школи** - Повна навчальна програма для викладання в класі

source: ✅ **Robotics Clubs** - Ready-made lessons and projects
ru: ✅ **Клубы робототехники** - готовые уроки и проекты
uk: ✅ * Клуби робототехніки** - Готові уроки та проекти

source: ✅ **Educational Institutions** - Professional platform with full documentation
ru: ✅ **Образовательные учреждения** - Профессиональная платформа с полной документацией
uk: ✅ **Навчальні заклади** - Професійна платформа з повною документацією

source: ✅ **Home Learning** - Anyone can learn independently by building the simplest version
ru: ✅ **Обучение дома** - Любой может самостоятельно учиться, создав самую простую версию
uk: ✅ **Домашнє навчання** - Кожен може вчитися самостійно, створивши найпростішу версію

source: **All information, instructions, and components needed to build both platforms are available in our repositories and this guide!**
ru: **Вся информация, инструкции и компоненты, необходимые для создания обеих платформ, доступны в наших репозиториях и в этом руководстве!**
uk: **Вся інформація, інструкції та компоненти, необхідні для побудови обох платформ, доступні в наших Git та цьому посібнику!**

source: Why Choose БАБАЙ?
ru: Почему выбирают БАБАЙ.DIY?
uk: Чому обирати БАБАЙ.DIY?

source: 🎓 **Educational Focus**
ru: 🎓 **Фокус на образование**
uk: 🎓 **Освітній фокус**

source: Designed specifically for teaching, not just building robots
ru: Спроектировано специально для обучения, а не только создания роботов
uk: Розроблений спеціально для викладання, а не просто побудови роботів

source: 🔓 **Open Source**
ru: 🔓 **Открытый исходный код**
uk: 🔓 **Відкритий код**

source: All designs, code, and materials are freely available
ru: Все проекты, код и материалы свободно доступны
uk: Усі конструкції, код та матеріали вільно доступні

source: 🛠️ **DIY Friendly**
ru: 🛠 **Простота в сборке**
uk: 🛠 **Простий у збірці**

source: Build it yourself with our detailed instructions
ru: Соберите своего робота самостоятельно с нашими подробными инструкциями
uk: Побудуйте це самостійно за допомогою наших детальних інструкцій

source: 📖 **Complete Documentation**
ru: 📖 **Полная документацыя**
uk: Документація БАБАЙ.DIY

source: Every step covered - from assembly to programming
ru: Каждый шаг расписан - от сборки до программирования
uk: Кожен крок, що розписаний - від складання до програмування

source: 👥 **Community Driven**
ru: 👥 **Управляется сообществом**
uk: 👥 **Керується спільнотою**

source: Created by teachers and IT professionals
ru: Создано учителями и IT-специалистами
uk: Створений викладачами та ІТ -фахівцями

source: 💡 **STEM Methodology**
ru: 💡 **Методология STEM**
uk: 💡 **STEM методика**

source: Learn by doing - practical approach to education
ru: Изучайте, используя практическое подход к образованию
uk: Вивчайте, використовуючи - практичний підхід до освіти

source: 🌍 **Accessible**
ru: 🌍 **Доступность**
uk: 🌍 **Доступний**

source: Affordable components, no rare or expensive parts needed
ru: Доступные компоненты, не требуются редкие или дорогие детали
uk: Доступні компоненти, не потрібні рідкісні або дорогі деталі

source: What You'll Learn
ru: Чему вы научитесь
uk: Що ти навчишся

source: Through БАБАЙ platform, students will master:
ru: Благодаря платформе БАБАЙ.DIY, студенты осваивают:
uk: На платформі БАБАЙ.DIY студенти будуть опанувати:

source: 🤖 **Robotics** - Mechanical assembly and robot design
ru: 🤖 **Робототехнику** - Механическая сборка и дизайн робота
uk: 🤖 **Робототехніку** - Механічна збірка та дизайн роботів

source: 💻 **Programming** - Arduino, C++, algorithms
ru: 💻 **Программирование** - Arduino, C ++, Алгоритмы
uk: 💻 **Програмування** - Arduino, C ++, алгоритми

source: ⚡ **Electronics** - Circuits, sensors, actuators
ru: ⚡ **Электронику** - Схемы, датчики, приводы
uk: ⚡ **Електроніка** - схеми, датчики, приводи

source: 🔧 **Problem Solving** - Debug and optimize your projects
ru: 🔧 **Решение проблем** - отладка и оптимизация проектов
uk: 🔧 **Вирішення проблем** - налагодження та оптимізація ваших проектів

source: 🎨 **Creativity** - Design and customize your robots
ru: 🎨 **Творчество** - Создавайте и настраивайте свои роботы
uk: 🎨 **Творчість** - Дизайн та налаштування своїх роботів

source: This Documentation Covers
ru: Документация БАБАЙ.DIY
uk: Документація БАБАЙ.DIY

source: 📋 **Assembly Instructions**
ru: 📋 **Инструкции по сборке**
uk: 📋 **Інструкції по збірці**

source: Step-by-step building guides for both platforms
ru: Пошаговые руководства по сборке для обеих платформ
uk: Покрокові інструкції по збірці для обох платформ

source: 🔍 **Testing & Verification**
ru: 🔍 **Тестирование и проверка**
uk: 🔍 **Тестування та перевірка**

source: How to check and validate your build
ru: Как проверить и настроить своего робота
uk: Як перевірити та підтвердити свою збірку

source: ⚙️ **Setup & Configuration**
ru: ⚙ **Настройка и конфигурация**
uk: ⚙ **Налаштування та конфігурація**

source: Software installation and robot setup
ru: Установка программного обеспечения и настройка робота
uk: Встановлення програмного забезпечення та налаштування роботів

source: 💾 **Software Installation**
ru: 💾 **Установка программного обеспечения**
uk: 💾 **Встановлення програмного забезпечення**

source: IDE setup, libraries, and tools
ru: Настройка IDE, библиотеки и инструменты
uk: Налаштування IDE, бібліотеки та інструменти

source: 🐛 **Debugging & Troubleshooting**
ru: 🐛 **Отладка и устранение неполадок**
uk: 🐛 **Налагодження та усунення несправностей**

source: Common issues and solutions
ru: Общие проблемы и решения
uk: Поширені проблеми та рішення

source: 🎮 **Platform Usage**
ru: 🎮 **Использование платформы**
uk: 🎮 **Використання платформи**

source: Programming tutorials and examples
ru: Учебники и примеры по программированию
uk: Підручники та приклади програмування

source: ⚠️ **Safety & Recommendations**
ru: ⚠️ **Безопасность и рекомендации**
uk: ⚠ **Безпека та рекомендації**

source: Important guidelines and best practices
ru: Важные руководящие принципы и лучшие практики
uk: Важливі вказівки та найкращі практики

source: Getting Started
ru: Начало работы

source: Ready to begin your robotics journey?
ru: Готовы начать путешествие в мир робототехники?
uk: Готові розпочати свою подорож в робототехніку?

source: **Read** :doc:`installation` - Learn about platform requirements
ru: **Read** :doc:`installation` - Узнайте о требованиях к платформе
uk: **Прочитати** :doc: `Installation` - Дізнайтеся про вимоги до платформи

source: **Build** - Follow assembly instructions for your chosen platform
ru: **Build** - Следуйте инструкциям по сборке для выбранной вами платформы
uk: **Build** - Дотримуйтесь інструкцій збору для обраної платформи

source: **Setup** - Install software and configure your robot
ru: **Setup** - Установите программное обеспечение и настройте робота
uk: **Setup** - Встановіть програмне забезпечення та налаштуйте свій робот

source: **Learn** - Start with :doc:`quickstart` lessons
ru: **Learn** - Начните с :doc:`quickstart` Уроков
uk: **Learn** - Почніть з :doc: `Quickstart` уроків

source: **Create** - Build your own projects!
ru: **Create** - Создайте свои собственные проекты!
uk: **Create** - Побудуйте власні проекти!

source: **New to robotics?** Start with БАБАЙ nano - it's designed for complete beginners!
ru: **Новичок в робототехнике?** Начните с БАБАЙ nano - он предназначен для начинающих!
uk: **New to robotics?** Почніть з БАБАЙ nano - він призначений для повних початківців!

source: Join the Community
ru: Присоединяйтесь к сообществу
uk: Приєднуйтесь до спільноти

source: 🤝 **Contribute** to the project - See :doc:`contributing`
ru: 🤝 **Внесите вклад** в проект - см. :doc:`contributing`
uk: 🤝 **Зробіть внесок** до проекту - Див. :doc: `contributing`

source: 💬 **Ask Questions** - Join our discussions on GitHub
ru: 💬 **Задайте вопросы** - Присоединяйтесь к нашим обсуждениям на GitHub
uk: 💬 **Задайте питання** - Приєднуйтесь до наших дискусій на Github

source: 📢 **Share** your projects and help others learn
ru: 📢 **Делитесь** вашими проектами и помогайте другим учиться
uk: 📢 **Поділіться** своїми проектами та допомагайте іншим вчитися

source: 🌟 **Support** - Star our repository and spread the word
ru: 🌟 **Поддержка** - Ставь звездочки в репозитории и распространяйте проект
uk: 🌟 **Підтримка** - Ставте зірки до репозиторію та просувайте проект

source: **Important:** Before contributing lessons or modifications, please discuss with moderators to ensure quality and alignment with educational goals.
ru: **Важно!** Прежде чем добавлять уроки или изменения, обсудите это с модераторами, чтобы обеспечить качество и соответствие образовательным целям.
uk: **ВАЖЛИВО:** Перш ніж внести уроки чи модифікації, будь ласка, обговоріть з модераторами, щоб забезпечити якість та узгодження з навчальними цілями.

source: Quick Links
ru: Быстрые ссылки
uk: Посилання

source: :ref:`genindex` - Complete index
ru: :ref:`genindex` - Общее

source: :ref:`modindex` - Module index
ru: :ref:`modindex` - Модули

source: :ref:`search` - Search documentation
ru: :ref:`search` - Поиск по документации
uk: :ref:`search` - Пошук документації

source: 🚀 Start Building. Start Learning. Start Creating! 🚀
ru: 🚀 Стройте. Изучайте. Создавайте! 🚀
uk: 🚀 Збирайте. Вчіться. Творіть! 🚀
