Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: uk

source: Installation
uk: Встановлення

source: This guide will help you install and set up ByByte.
uk: Цей посібник допоможе вам встановити та налаштувати ByByte.

source: Requirements
uk: Вимоги

source: Arduino IDE or compatible software
uk: Arduino IDE або сумісне програмне забезпечення

source: Required hardware components
uk: Необхідні апаратні компоненти

source: Python 3.x (for tools)
uk: Python 3.x (для інструментів)

source: Installation Steps
uk: Кроки встановлення

source: Clone the repository:
uk: Клонуйте репозиторій:

source: Install dependencies:
uk: Встановіть залежності:

source: Configure the project:
uk: Налаштуйте проект:

source: Hardware Setup
uk: Налаштування обладнання

source: Connect your Arduino board according to the wiring diagram.
uk: Підключіть вашу плату Arduino згідно зі схемою підключення.

source: Make sure to disconnect power before making any hardware connections.
uk: Переконайтеся, що живлення відключено перед виконанням будь-яких апаратних підключень.

source: Verification
uk: Перевірка

source: To verify your installation:
uk: Щоб перевірити ваше встановлення:

source: If everything is configured correctly, you should see a success message.
uk: Якщо все налаштовано правильно, ви побачите повідомлення про успіх.

source: Next Steps
uk: Наступні кроки

source: Continue to the :doc:`quickstart` guide to begin using ByByte.
uk: Перейдіть до посібника :doc:`quickstart`, щоб почати використовувати ByByte.
