Repository: ByByte-diy/ByByteDoc
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: uk

source: Quick Start Guide
uk: Посібник з швидкого початку

source: This quick start guide will help you get up and running with ByByte in minutes.
uk: Цей посібник із швидкого старту допоможе вам встати та бігати з Bybyte за лічені хвилини.

source: Basic Usage
uk: Основне використання

source: Upload the firmware to your Arduino:
uk: Завантажте прошивку до свого Arduino:

source: First Example
uk: Перший приклад

source: Here's a simple example to get you started:
uk: Ось простий приклад, щоб розпочати роботу:

source: Common Commands
uk: Загальні команди

source: ``status`` - Get device status
uk: `` `states`` - Отримати стан пристрою

source: ``reset`` - Reset the device
uk: `` Скидання'` ' - скинути пристрій

source: ``info`` - Get device information
uk: `` info`` 'отримайте інформацію про пристрій

source: Configuration
uk: Конфігурація

source: Basic configuration options:
uk: Основні параметри конфігурації:

source: Next Steps
uk: Наступні кроки

source: Read the full :doc:`usage` guide
uk: Прочитайте повне: DOC: `` Використання `Посібник

source: Check the :doc:`api` reference
uk: Перевірте посилання: `` api`

source: Explore example projects
uk: Дослідіть приклади прикладів

source: Troubleshooting
uk: Усунення несправностей

source: **Connection Issues**
uk: ** Випуски підключення **

source: If you can't connect to the device:
uk: Якщо ви не можете підключитися до пристрою:

source: Check that the device is properly connected
uk: Перевірте, чи правильно підключений пристрій

source: Verify the correct port is specified
uk: Перевірте правильний порт, вказаний

source: Ensure no other program is using the port
uk: Переконайтесь, що жодна інша програма не використовує порт

source: **Permission Denied**
uk: ** Дозвіл заперечується **

source: On Linux, you may need to add your user to the ``dialout`` group:
uk: У Linux вам може знадобитися додати свого користувача до групи `` `dialout`` '
